<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-aksikan">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Nokia SR OS Documentation</title>
    <script src="https://cdn.tailwindcss.com"></script>
    <link href="https://fonts.googleapis.com/css2?family=Inter:wght@400;500;600;700&display=swap" rel="stylesheet">
    <script>
        // Set theme immediately to prevent FOUC (Flash of Unstyled Content)
        if (localStorage.getItem('theme') === 'dark' || (!('theme' in localStorage) && window.matchMedia('(prefers-color-scheme: dark)').matches)) {
            document.documentElement.classList.add('dark');
        } else {
            document.documentElement.classList.remove('dark');
        }

        tailwind.config = {
            darkMode: 'class',
            theme: {
                extend: {
                    fontFamily: {
                        sans: ['Inter', 'sans-serif'],
                    },
                },
            },
        }
    </script>
    <style>
        body {
            -webkit-font-smoothing: antialiased;
            -moz-osx-font-smoothing: grayscale;
        }
        /* Custom scrollbar for webkit browsers */
        ::-webkit-scrollbar {
            width: 8px;
            height: 8px;
        }
        ::-webkit-scrollbar-track {
            background: #f1f5f9; /* slate-100 */
        }
        .dark ::-webkit-scrollbar-track {
            background: #1e293b; /* slate-800 */
        }
        ::-webkit-scrollbar-thumb {
            background: #cbd5e1; /* slate-300 */
            border-radius: 10px;
        }
        .dark ::-webkit-scrollbar-thumb {
            background: #475569; /* slate-600 */
        }
        ::-webkit-scrollbar-thumb:hover {
            background: #94a3b8; /* slate-400 */
        }
        .dark ::-webkit-scrollbar-thumb:hover {
            background: #64748b; /* slate-500 */
        }
        
        /* Sidebar Styles */
        .sidebar-link.active {
            background-color: #2563eb; /* blue-600 */
            color: white;
            font-weight: 600;
        }
        .dark .sidebar-link.active {
            background-color: #3b82f6; /* blue-500 */
        }

        /* Styling for content elements */
        .content-area h2 {
            font-size: 1.75rem; /* text-2xl */
            font-weight: 700; /* bold */
            color: #334155; /* slate-700 */
            margin-bottom: 1rem;
            margin-top: 1.5rem;
            padding-bottom: 0.5rem;
            border-bottom: 1px solid #e2e8f0; /* slate-200 */
        }
        .dark .content-area h2 {
            color: #e2e8f0; /* slate-200 */
            border-bottom-color: #334155; /* slate-700 */
        }

        .content-area h2:first-child {
            margin-top: 0;
        }
        .content-area h3 {
            font-size: 1.25rem; /* text-xl */
            font-weight: 600; /* semibold */
            color: #475569; /* slate-600 */
            margin-bottom: 0.75rem;
            margin-top: 1.25rem;
        }
        .dark .content-area h3 {
             color: #cbd5e1; /* slate-300 */
        }

        .content-area p, .content-area ul, .content-area ol {
            color: #475569; /* slate-600 */
            margin-bottom: 0.75rem;
            line-height: 1.6;
        }
         .dark .content-area p, .dark .content-area ul, .dark .content-area ol {
            color: #94a3b8; /* slate-400 */
        }
        
        .content-area ul {
            list-style: disc;
            margin-left: 1.5rem;
        }
        .content-area ol {
            list-style: decimal;
            margin-left: 1.5rem;
        }
        .content-area code:not(pre code) {
            background-color: #e2e8f0; /* slate-200 */
            color: #c026d3; /* fuchsia-600 */
            padding: 0.125rem 0.25rem;
            border-radius: 0.25rem;
            font-size: 0.9em;
        }
        .dark .content-area code:not(pre code) {
            background-color: #334155; /* slate-700 */
            color: #e879f9; /* fuchsia-400 */
        }
        .content-area a {
            color: #2563eb; /* blue-600 */
            text-decoration: underline;
        }
        .dark .content-area a {
            color: #60a5fa; /* blue-400 */
        }
        
        /* Monostyle/Terminal Style Code Blocks */
        .content-area pre {
            background-color: #1e293b; /* slate-800 */
            color: #93c5fd; /* blue-300 */
            padding: 1rem;
            border-radius: 0.375rem; /* rounded-md */
            overflow-x: auto;
            margin-bottom: 1rem; 
            font-family: 'Courier New', Courier, monospace;
            font-size: 0.9em;
            position: relative;
        }
        
        .content-area .note {
            background-color: #eff6ff; /* blue-50 */
            border-left: 4px solid #3b82f6; /* blue-500 */
            padding: 0.75rem 1rem;
            margin-bottom: 1rem;
            border-radius: 0.25rem;
        }
        .dark .content-area .note {
            background-color: rgba(59, 130, 246, 0.1);
        }
        .content-area .note p {
            color: #1e3a8a; /* blue-800 */
            margin-bottom: 0;
        }
        .dark .content-area .note p {
            color: #bfdbfe; /* blue-200 */
        }
        .content-area .note p strong {
             color: #1e3a8a; /* blue-800 */
        }
        .dark .content-area .note p strong {
            color: #dbeafe; /* blue-100 */
        }
        
        /* Copy Button Styles */
        .copy-button {
            position: absolute;
            top: 0.5rem;
            right: 0.5rem;
            padding: 0.25rem 0.5rem;
            background-color: #4b5563; /* gray-600 */
            color: #e5e7eb; /* gray-200 */
            border: none;
            border-radius: 0.25rem; /* rounded-sm */
            cursor: pointer;
            opacity: 0;
            transition: opacity 0.2s ease-in-out;
            font-size: 0.8rem;
        }
        pre:hover .copy-button {
            opacity: 1;
        }
        .copy-button:hover {
            background-color: #374151; /* gray-700 */
        }

    </style>
</head>
<body class="bg-gray-100 dark:bg-slate-900 text-slate-800 dark:text-slate-300 flex flex-col h-screen">

    <header class="bg-slate-700 dark:bg-slate-800 text-white p-4 shadow-md dark:shadow-lg z-10 flex justify-between items-center">
        <h1 class="text-xl font-semibold tracking-wide">Nokia SR OS Basics Tutorial</h1>
        <button id="theme-toggle" class="p-2 rounded-md hover:bg-slate-600 dark:hover:bg-slate-700 text-slate-300 focus:outline-none focus:ring-2 focus:ring-slate-400">
            <svg id="theme-toggle-dark-icon" class="hidden h-5 w-5" fill="currentColor" viewBox="0 0 20 20" xmlns="http://www.w3.org/2000/svg"><path d="M17.293 13.293A8 8 0 016.707 2.707a8.001 8.001 0 1010.586 10.586z"></path></svg>
            <svg id="theme-toggle-light-icon" class="hidden h-5 w-5" fill="currentColor" viewBox="0 0 20 20" xmlns="http://www.w3.org/2000/svg"><path d="M10 2a1 1 0 011 1v1a1 1 0 11-2 0V3a1 1 0 011-1zm4 8a4 4 0 11-8 0 4 4 0 018 0zm-.464 4.95l.707.707a1 1 0 001.414-1.414l-.707-.707a1 1 0 00-1.414 1.414zm2.12-10.607a1 1 0 010 1.414l-.706.707a1 1 0 11-1.414-1.414l.707-.707a1 1 0 011.414 0zM17 11a1 1 0 100-2h-1a1 1 0 100 2h1zm-7 4a1 1 0 011 1v1a1 1 0 11-2 0v-1a1 1 0 011-1zM5.05 6.464A1 1 0 106.465 5.05l-.708-.707a1 1 0 00-1.414 1.414l.707.707zm1.414 8.486l-.707.707a1 1 0 01-1.414-1.414l.707-.707a1 1 0 011.414 1.414zM4 11a1 1 0 100-2H3a1 1 0 100 2h1z" fill-rule="evenodd" clip-rule="evenodd"></path></svg>
        </button>
    </header>

    <div class="flex flex-1 overflow-hidden">
        <aside id="sidebar" class="w-72 bg-slate-100 dark:bg-slate-800 text-gray-800 dark:text-gray-300 p-5 space-y-1 overflow-y-auto shadow-lg">
            </aside>

        <main id="content-area" class="flex-1 p-6 md:p-8 bg-white dark:bg-slate-900 overflow-y-auto content-area">
            <div id="initial-message">
                <h2>Welcome to the Nokia SR OS Basics Tutorial!</h2>
                <p>Select a topic from the sidebar to get started with the Nokia SR OS Basics tutorial.</p>
            </div>
        </main>
    </div>

    <script>
        // --- Topics Data (Content is minified for brevity) ---
        const topics = [
            { id: 'introduction', title: 'Introduction to SR OS', content: `<h2>Introduction to SR OS</h2><p><a href="https://www.nokia.com/ip-networks/service-router-operating-system-nos/" target="_blank" rel="noopener noreferrer">Nokia Service Router Operating System (SR OS)</a>, is a robust, high-performance, and feature-rich network operating system designed for service provider and large enterprise networks. It powers Nokia's portfolio of IP/MPLS routers, including the <a href="https://www.nokia.com/ip-networks/7750-service-router/" target="_blank" rel="noopener noreferrer"> 7750 Service Router (SR/SR-s) series</a>, the <a href="https://www.nokia.com/ip-networks/7250-interconnect-router/" target="_blank" rel="noopener noreferrer"> 7250 Interconnect Router (IXR) series</a> and the <a href="https://www.nokia.com/ip-networks/7705-service-aggregation-router/" target="_blank" rel="noopener noreferrer"> 7705 Service Aggregation Router (SAR) series.</a></p><h3>Key Characteristics of SR OS:</h3><ul><li><strong>Reliability and Scalability:</strong> Built for carrier-grade environments, SR OS offers high availability features, non-stop routing, and massive scalability in terms of forwarding capacity and service instances.</li><li><strong>Rich Service Portfolio:</strong> It supports a wide array of services, including Layer 2 VPNs (VPLS, E-VPN), Layer 3 VPNs (VPRN, E-VPN), Internet Enhanced Services (IES), and advanced subscriber management features.</li><li><strong>Hierarchical QoS:</strong> SR OS provides a sophisticated Quality of Service (QoS) framework, allowing for granular traffic management and service differentiation.</li><li><strong>Comprehensive OAM:</strong> Extensive Operations, Administration, and Maintenance (OAM) tools are integrated for service assurance and troubleshooting across IP/MPLS networks.</li><li><strong>Model-Driven Management:</strong> SR OS strongly emphasizes model-driven management. This tutorial focuses on the Model-Driven Command Line Interface (MD-CLI), which aligns with YANG models for structured configuration and state, ensuring consistency with NETCONF and gRPC interfaces.</li></ul><p>This tutorial aims to provide you with the fundamental knowledge to navigate and perform basic configurations on an SR OS device using the MD-CLI. We'll cover MD-CLI basics, system setup, interface configuration, and an introduction to routing.</p><div class="note"><p><strong>Note:</strong> While SR OS also supports a "Classic CLI", this tutorial exclusively covers the MD-CLI (default since Release R23.3). Command syntax and output may vary slightly depending on the SR OS version and specific hardware platform. Examples are based on the SR OS R25 release.</p></div>` },
            { id: 'cli-navigation', title: 'MD-CLI Navigation & Modes', content: `<h2>SR OS Model-Driven Command Line Interface</h2><p>The MD-CLI is a modern interface for configuring, monitoring, and troubleshooting Nokia routers. It is based on YANG models, providing a structured and transactional approach to configuration.</p><h3>Accessing the CLI</h3><p>Typically, you access the MD-CLI via:</p><ul><li><strong>Console Port:</strong> Direct physical connection.</li><li><strong>SSH (Secure Shell):</strong> Recommended for remote access.</li><li><strong>Telnet:</strong> Less secure (disabled by default).</li></ul><p>By default, recent SR OS versions boot into the MD-CLI environment.</p><h3>MD-CLI Prompts and Modes</h3><p>The MD-CLI prompt indicates the current mode and configuration path. Common prompts include:</p><ul><li><strong>Operational Mode:</strong> <code>[/]</code> or <code>[ro:/]</code> (read-only operational). Example: <code>[/] user@hostname#</code></li><li><strong>Configuration Edit Modes:</strong><ul><li><code>[pr:/configure system] user@hostname#</code> (Private Edit Mode)</li><li><code>[ex:/configure system] user@hostname#</code> (Exclusive Edit Mode)</li><li><code>[gl:/configure system] user@hostname#</code> (Global Edit Mode)</li></ul></li></ul><p>To enter a configuration mode (e.g., private edit mode):</p><pre><code>[/]
A:admin@SR-1# edit-config private
[pr:/]
A:admin@SR-1#</code></pre><p>Or, more commonly, by directly navigating into a configuration branch, which implicitly enters an edit mode (often private by default if not specified):</p><pre><code>[/]
A:admin@SR-1# configure system
INFO: Entered [private] edit mode.
[pr:/configure system]
A:admin@SR-1#</code></pre><h3>Transactional Configuration</h3><p>MD-CLI uses a transactional model:</p><ol><li>Changes are made in a <strong>candidate configuration</strong> (e.g., in private, exclusive, or global edit mode).</li><li>Changes are reviewed using <code>info</code> or <code>compare</code>.</li><li>Changes are applied to the <strong>running configuration</strong> using the <code>commit</code> command.</li><li>Changes can be discarded before committing using the <code>discard</code> command.</li></ol><pre><code>*[pr:/configure system]
A:admin@SR-1# name "MyNewRouter"
*[pr:/configure system]
A:admin@SR-1# info
    name "MyNewRouter"
*[pr:/configure system]
A:admin@SR-1# commit
Commit Succeeded.
[pr:/configure system]
A:admin@SR-1#</code></pre><h3>Basic Navigation and Help</h3><ul><li><code>?</code> or <code>help</code>: Displays available commands or options within the current context.</li><li><code>Tab</code> key: Autocompletes commands and parameters.</li><li><code>Up/Down Arrow</code> keys: Cycle through command history.</li><li><code>environment console output more disabled</code>: Disables output paging for long command outputs.</li><li><code>info</code>: Displays the candidate configuration of the current context.</li><li><code>info detail</code>: Displays the candidate configuration of the current context including default values.</li><li><code>up</code>: Moves up one level in the configuration hierarchy.</li><li><code>top</code>: Moves to the top of the configuration hierarchy (e.g., <code>/configure</code>).</li><li><code>exit</code>: Exits the current configuration mode or context. <code>exit all</code> exits all levels back to operational mode.</li><li><code>quit</code>: Exits the CLI session.</li></ul><h3>Example: Viewing System State and Configuration</h3><pre><code># To show operational state
[/]
A:admin@SR-1# show system information
[/]
A:admin@SR-1# show card detail
[/]
A:admin@SR-1# show bof

# To show the entire running configuration
[/]
A:admin@SR-1# admin show configuration</code></pre><div class="note"><p>The <code>admin show configuration</code> command is the MD-CLI equivalent of <code>admin display-config</code> from the classic CLI.</p></div>` },
            { id: 'config-management', title: 'Configuration Management', content: `<h2>Configuration Management</h2><p>MD-CLI provides a robust, transactional approach to configuration management, emphasizing candidate configurations, commits, and rollbacks.</p><h3>Applying Configuration (Commit)</h3><p>Changes made in an edit mode (e.g., private, exclusive, global) are held in a candidate configuration. To make them active in the running configuration:</p><pre><code>*[pr:/configure system]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><p>The <code>commit</code> command validates the changes and applies them atomically. You can add comments to commits: <code>commit comment "Added new OSPF interface"</code>.</p><h3>Persisting Configuration for Boot</h3><p>After a successful <code>commit</code>, the changes are live in the running configuration. To ensure these settings are used after a reboot, the running configuration should be saved to the primary configuration file specified in the BOF (e.g., <code>cf3:/config.cfg</code>).</p><pre><code>[/]
A:admin@SR-1# admin file save running-configuration cf3:/config.cfg
Successfully saved cf3:/config.cfg</code></pre><p>This step ensures that the active configuration becomes the startup configuration.</p><h3>Discarding Changes</h3><p>If you want to abandon changes made in the candidate configuration before committing:</p><pre><code>*[pr:/configure system]
A:admin@SR-1# discard
All changes in current edit mode have been discarded.
[pr:/configure system]
A:admin@SR-1#</code></pre><h3>BOF (Boot Options File) Configuration</h3><p>BOF settings are configured under <code>/configure bof</code> and applied with a <code>commit</code>.</p><pre><code>*[pr:/configure bof]
A:admin@SR-1# primary-config url "cf3:/my-main-config.cfg"
*[pr:/configure bof]
A:admin@SR-1# primary-image url "cf3:/sros-main.tim"
*[pr:/configure bof]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><p>View current BOF: <code>[/]# show bof</code> or <code>[/]# admin show configuration bof</code>.</p><h3>Redundant Systems Synchronization</h3><p>Synchronize configuration from the active CPM to the standby CPM:</p><pre><code>[/]
A:admin@SR-1# admin redundancy synchronize configuration</code></pre><p>You can also synchronize the boot environment (including BOF): <code>[/]# admin redundancy synchronize boot-environment</code>.</p><h3>Rollback to Previous Configurations</h3><p>MD-CLI maintains a history of committed configurations. You can roll back the <strong>candidate</strong> configuration to a previous state using the <code>rollback</code> command from within any configuration mode context.</p><pre><code># First, find the commit ID you want to roll back to
[/]
A:admin@SR-1# show system management-interface commit-history

# Now, enter a configuration mode and execute the rollback
[/]
A:admin@SR-1# edit-config private
[pr:/]
A:admin@SR-1# configure
[pr:/configure]
A:admin@SR-1# rollback 1
[pr:/configure]
A:admin@SR-1# compare to running
[pr:/configure]
A:admin@SR-1# commit</code></pre><p>Alternatively, to directly revert the <strong>running</strong> configuration without entering a configuration mode, you can use the <code>admin system rollback</code> operational command. Use this with caution.</p><pre><code>[/]
A:admin@SR-1# admin system rollback 1 confirmed 5</code></pre><h3>Backing Up Configuration</h3><p>Save the running or candidate configuration to an external server (e.g., FTP, SFTP, SCP).</p><pre><code>[/]
A:admin@SR-1# admin file copy source-url running-configuration destination-url ftp://user:pass@ftpserver/backup/myrouter-config.cfg</code></pre><p>You can also save the BOF:</p><pre><code>[/]
A:admin@SR-1# admin file copy source-url cf3:/bof.cfg destination-url ftp://user:pass@ftpserver/backup/myrouter-bof.cfg</code></pre><h3>Comparing Configurations</h3><p>Within an edit mode, compare the candidate configuration with the running configuration, a file, or a previous commit:</p><pre><code>[pr:/configure system]
A:admin@SR-1# compare to running
[pr:/configure system]
A:admin@SR-1# compare to file cf3:/backup-config.cfg
[pr:/configure system]
A:admin@SR-1# compare to rollback 1</code></pre><h3>Management Interface Configuration</h3><p>The management interface IP can be configured under <code>/configure system management-interface</code> and committed. Persistence is typically handled by BOF settings (<code>persist admin-state enable/disable</code> in <code>/configure bof</code>).</p><pre><code>*[pr:/configure system management-interface]
A:admin@SR-1# static-interface "management" ipv4 address 192.168.100.5/24
*[pr:/configure system management-interface]
A:admin@SR-1# commit</code></pre>`},
            { id: 'initial-setup', title: 'Initial System Setup', content: `<h2>Initial System Configuration</h2><p>After initial access, several basic system parameters should be configured using MD-CLI's transactional approach.</p><h3>1. Setting the Hostname</h3><p>The hostname identifies the router.</p><pre><code>[/]
A:admin@SR-1# edit-config private
[pr:/]
A:admin@SR-1# configure system
*[pr:/configure system]
A:admin@SR-1# name "MyCoreRouter1"
*[pr:/configure system]
A:admin@SR-1# commit
Commit Succeeded.
[pr:/configure system]
A:admin@MyCoreRouter1# exit all
[/]
A:admin@MyCoreRouter1#
</code></pre><h3>2. Boot Options File (BOF)</h3><p>The BOF (<code>bof.cfg</code>) controls boot-time parameters. Changes are made in the <code>/configure bof</code> context and then committed.</p><pre><code>[/]
A:admin@SR-1# configure bof
*[pr:/configure bof]
A:admin@SR-1# console speed 115200
*[pr:/configure bof]
A:admin@SR-1# address 192.168.1.10/24 active true
*[pr:/configure bof]
A:admin@SR-1# static-route 0.0.0.0/0 next-hop 192.168.1.1
*[pr:/configure bof]
A:admin@SR-1# persist admin-state disable
*[pr:/configure bof]
A:admin@SR-1# info
    console {
        speed 115200
    }
    address 192.168.1.10/24 {
        active true
    }
    static-route 0.0.0.0/0 {
        next-hop 192.168.1.1
    }
    persist {
        admin-state disable
    }
*[pr:/configure bof]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><p>View BOF settings from operational mode: <code>[/]# admin show configuration bof</code> or <code>[/]# show bof</code>.</p><h3>3. Time Configuration (Clock & NTP)</h3><p>Accurate time is important for logging and troubleshooting.</p><pre><code>[/]
A:admin@SR-1# configure system time
*[pr:/configure system time]
A:admin@SR-1# time-zone name "EST-05:00"
*[pr:/configure system time]
A:admin@SR-1# ntp
*[pr:/configure system time/ntp]
A:admin@SR-1# server 192.0.2.100
*[pr:/configure system time/ntp]
A:admin@SR-1# admin-state enable
*[pr:/configure system time/ntp]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><p>Verify with <code>[/]# show system time</code> and <code>[/]# show system ntp</code>.</p><h3>4. User Accounts</h3><p>Configure user accounts for administrative access.</p><pre><code>[/]
A:admin@SR-1# configure system security user "adminuser"
*[pr:/configure system security user "adminuser"]
A:admin@SR-1# password
New password: ********
Confirm password: ********
*[pr:/configure system security user "adminuser"]
A:admin@SR-1# access cli console netconf grpc ftp snmp
*[pr:/configure system security user "adminuser"]
A:admin@SR-1# console member "administrative"
*[pr:/configure system security user "adminuser"]
A:admin@SR-1# commit
Commit Succeeded.</code></pre>` },
            { id: 'interface-config', title: 'Interface Configuration', content: `<h2>Interface Configuration</h2><p>Configuring interfaces for network connectivity in MD-CLI involves setting port attributes and then defining logical IP interfaces.</p><h3>Ports and Interfaces</h3><ul><li><strong>Port:</strong> Represents a physical or logical connection point (e.g., <code>1/1/1</code>, <code>lag-1</code>). Ports have physical layer attributes.</li><li><strong>Interface:</strong> A logical Layer 3 entity (e.g., within a router instance like "Base") associated with a port or a service. IP addresses are configured on interfaces.</li></ul><h3>Configuring a Network Interface (Ethernet)</h3><p>Example: Configure port <code>1/1/1</code> and assign an IP address to an interface using it.</p><pre><code>[/]
A:admin@SR-1# configure port 1/1/1 ethernet
*[pr:/configure port 1/1/1 ethernet]
A:admin@SR-1# admin-state enable
*[pr:/configure port 1/1/1 ethernet]
A:admin@SR-1# up
[pr:/]
A:admin@SR-1# configure router "Base" interface "to_peer_router"
*[pr:/configure router "Base" interface "to_peer_router"]
A:admin@SR-1# ipv4 primary address 10.0.0.1 prefix-length 24
*[pr:/configure router "Base" interface "to_peer_router"]
A:admin@SR-1# port 1/1/1
*[pr:/configure router "Base" interface "to_peer_router"]
A:admin@SR-1# admin-state enable
*[pr:/configure router "Base" interface "to_peer_router"]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>Configuring a Loopback Interface</h3><p>Loopback interfaces are virtual interfaces, often used for router ID or management.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" interface "loopback0"
*[pr:/configure router "Base" interface "loopback0"]
A:admin@SR-1# ipv4 primary address 192.168.255.1 prefix-length 32
*[pr:/configure router "Base" interface "loopback0"]
A:admin@SR-1# loopback true
*[pr:/configure router "Base" interface "loopback0"]
A:admin@SR-1# admin-state enable
*[pr:/configure router "Base" interface "loopback0"]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>Verification Commands (Operational Mode)</h3><ul><li><code>[/]
A:admin@SR-1# show port 1/1/1 detail</code></li><li><code>[/]
A:admin@SR-1# show router "Base" interface "to_peer_router" detail</code></li></ul><h3>Common Port Settings</h3><p>Within the <code>[pr:/configure port &lt;port-id&gt; ethernet]</code> context:</p><ul><li><code>mode (access | network | hybrid)</code>: Sets the port mode. Default is network.</li><li><code>mtu &lt;bytes&gt;</code>: Sets the Maximum Transmission Unit.</li><li><code>autonegotiate admin-state (enable | disable | limited)</code>: Configures autonegotiation.</li><li><code>speed (10 | 100 | 1000 | ...)</code>: Manually sets port speed if autonegotiation is off.</li><li><code>duplex (full | half)</code>: Manually sets duplex if autonegotiation is off.</li></ul><div class="note"><p>Remember to use <code>admin-state enable</code> (equivalent to <code>no shutdown</code>) at both the port and interface levels and then <code>commit</code> the changes.</p></div>` },
            { id: 'static-routing', title: 'Static Routing', content: `<h2>Static Routing</h2><p>Static routes manually define paths to destination networks. They are configured within the router instance context.</p><h3>Configuring a Static Route</h3><p>Example: Route traffic to network <code>172.16.10.0/24</code> via next-hop <code>10.0.0.2</code> in router instance "Base".</p><pre><code>[/]
A:admin@SR-1# configure router "Base" static-routes route 172.16.10.0/24
*[pr:/...router "Base" static-routes route 172.16.10.0/24]
A:admin@SR-1# next-hop 10.0.0.2
*[pr:/...router "Base" static-routes route 172.16.10.0/24]
A:admin@SR-1# admin-state enable
*[pr:/...router "Base" static-routes route 172.16.10.0/24]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>Static Route Options</h3><p>Within the <code>[pr:/configure router "Base" static-routes route &lt;prefix&gt;]</code> context:</p><ul><li><strong>Next-hop IP address:</strong> <code>next-hop &lt;ip-address&gt;</code></li><li><strong>Interface name:</strong> <code>interface &lt;interface-name&gt;</code> (for point-to-point).</li><li><strong>Blackhole:</strong> <code>blackhole true</code> (discards traffic).</li><li><strong>Preference (Administrative Distance):</strong> <code>preference &lt;value&gt;</code> (Default for static is 5).</li><li><strong>Metric:</strong> <code>metric &lt;value&gt;</code>.</li></ul><h3>Verification (Operational Mode)</h3><p>To view the routing table and verify static routes:</p><pre><code>[/]
A:admin@SR-1# show router "Base" route-table
[/]
A:admin@SR-1# show router "Base" route-table 172.16.10.0/24 detail</code></pre><p>Look for routes with protocol "Static".</p><div class="note"><p>For a default static route (0.0.0.0/0):</p><pre><code>[pr:/]
A:admin@SR-1# configure router "Base" static-routes route 0.0.0.0/0
*[pr:/...router "Base" static-routes route 0.0.0.0/0]
A:admin@SR-1# next-hop &lt;gateway_ip&gt;
*[pr:/...router "Base" static-routes route 0.0.0.0/0]
A:admin@SR-1# admin-state enable
*[pr:/...router "Base" static-routes route 0.0.0.0/0]
A:admin@SR-1# commit</code></pre></div>` },
            { id: 'ospf-basics', title: 'OSPF', content: `<h2>OSPF</h2><p>Open Shortest Path First (OSPF) is a widely used Interior Gateway Protocol (IGP). This is a brief introduction to enabling OSPF on SR OS using MD-CLI.</p><h3>1. Router ID</h3><p>OSPF requires a unique Router ID. This is typically set to a loopback interface IP address.</p><pre><code>[/]
A:admin@SR-1# configure router "Base"
*[pr:/configure router "Base"]
A:admin@SR-1# router-id 192.168.255.1
*[pr:/configure router "Base"]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>2. Enabling OSPF Process</h3><p>OSPF is configured under <code>/configure router &lt;instance&gt; ospf &lt;instance-id&gt;</code>. Instance 0 is common for OSPFv2.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" ospf 0
*[pr:/configure router "Base" ospf 0]
A:admin@SR-1# admin-state enable
*[pr:/configure router "Base" ospf 0]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>3. Configuring an Area</h3><p>OSPF uses areas. Area 0 (<code>0.0.0.0</code>) is the backbone area.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" ospf 0 area 0.0.0.0
[pr:/configure router "Base" ospf 0 area 0.0.0.0]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>4. Adding Interfaces to OSPF</h3><p>Assign interfaces to an OSPF area.</p><p>Example: Add interface <code>"to_peer_router"</code> (IP: 10.0.0.1/24) to OSPF area 0.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" ospf 0 area 0.0.0.0 interface "to_peer_router"
*[pr:/...area 0.0.0.0 interface "to_peer_router"]
A:admin@SR-1# interface-type point-to-point
*[pr:/...area 0.0.0.0 interface "to_peer_router"]
A:admin@SR-1# admin-state enable
*[pr:/...area 0.0.0.0 interface "to_peer_router"]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>5. OSPF Verification (Operational Mode)</h3><ul><li><code>[/]
A:admin@SR-1# show router "Base" ospf 0 status</code></li><li><code>[/]
A:admin@SR-1# show router "Base" ospf 0 neighbor</code></li></ul><div class="note"><p>This is a very basic OSPF setup. Real-world OSPF configurations involve more details like authentication, area types, route summarization, etc., all configured within the MD-CLI structure.</p></div>` },
            { id: 'isis-basics', title: 'IS-IS', content: `<h2>IS-IS</h2><p>Intermediate System to Intermediate System (IS-IS) is another widely used Interior Gateway Protocol (IGP), particularly popular in large service provider networks. It's a link-state protocol like OSPF but has its own distinct characteristics and terminology (e.g., areas, levels, NET addresses).</p><h3>1. Enabling IS-IS Process</h3><p>IS-IS is configured under <code>/configure router &lt;instance&gt; isis &lt;instance-id&gt;</code>. Typically, instance 0 is used.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" isis 0
*[pr:/configure router "Base" isis 0]
A:admin@SR-1# admin-state enable
*[pr:/configure router "Base" isis 0]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>2. Configuring Network Entity Title (NET)</h3><p>A NET address is crucial for IS-IS. It identifies the router (System ID) and its area (Area ID).</p><p>Example NET: <code>49.0001.1921.6800.0001.00</code></p><pre><code>[/]
A:admin@SR-1# configure router "Base" isis 0
*[pr:/configure router "Base" isis 0]
A:admin@SR-1# net 49.0001.1921.6800.0001.00
*[pr:/configure router "Base" isis 0]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><div class="note"><p>Ensure the System ID portion of the NET is unique within the IS-IS domain. The <code>router-id</code> configured under <code>/configure router "Base"</code> is used by protocols like OSPF and BGP, but IS-IS relies on the System ID within its NET.</p></div><h3>3. Configuring IS-IS Level Capability</h3><p>IS-IS supports different routing levels.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" isis 0
*[pr:/configure router "Base" isis 0]
A:admin@SR-1# level-capability level-1/2
*[pr:/configure router "Base" isis 0]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>4. Adding Interfaces to IS-IS</h3><p>Assign interfaces to IS-IS. IS-IS must be enabled on the interface, and you can specify its level capability.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" isis 0 interface "to_peer_router"
*[pr:/... isis 0 interface "to_peer_router"]
A:admin@SR-1# admin-state enable
*[pr:/... isis 0 interface "to_peer_router"]
A:admin@SR-1# level-capability level-1/2
*[pr:/... isis 0 interface "to_peer_router"]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>5. IS-IS Verification (Operational Mode)</h3><ul><li><code>[/]
A:admin@SR-1# show router "Base" isis 0 status</code></li><li><code>[/]
A:admin@SR-1# show router "Base" isis 0 adjacency</code></li></ul>` },
            { id: 'bgp-basics', title: 'BGP', content: `<h2>BGP</h2><p>Border Gateway Protocol (BGP) is the primary routing protocol used to exchange routing information between autonomous systems (ASes) on the internet. It can also be used within an AS (iBGP).</p><h3>1. Enabling BGP Process & Router ID</h3><p>BGP is configured under <code>/configure router "Base" bgp</code>. A BGP router ID is mandatory and should be unique. It's often the same as the OSPF/IS-IS router ID (a loopback IP).</p><pre><code>[/]
A:admin@SR-1# configure router "Base"
*[pr:/configure router "Base"]
A:admin@SR-1# autonomous-system 65001
*[pr:/configure router "Base"]
A:admin@SR-1# bgp
*[pr:/configure router "Base" bgp]
A:admin@SR-1# admin-state enable
*[pr:/configure router "Base" bgp]
A:admin@SR-1# router-id 192.168.255.1
*[pr:/configure router "Base" bgp]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>2. Configuring BGP Groups</h3><p>Neighbors are organized into groups. Groups can define common policies or attributes for a set of neighbors.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" bgp group "eBGP-Peers"
*[pr:/configure router "Base" bgp group "eBGP-Peers"]
A:admin@SR-1# type external
*[pr:/configure router "Base" bgp group "eBGP-Peers"]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>3. Configuring BGP Neighbors</h3><p>External BGP neighbors are in different ASes.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" bgp group "eBGP-Peers" neighbor 10.0.0.2
*[pr:/... group "eBGP-Peers" neighbor 10.0.0.2]
A:admin@SR-1# admin-state enable
*[pr:/... group "eBGP-Peers" neighbor 10.0.0.2]
A:admin@SR-1# peer-as 65002
*[pr:/... group "eBGP-Peers" neighbor 10.0.0.2]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>4. Advertising Prefixes using Export Policies</h3><p>In SR OS, prefixes are not advertised using a <code>network</code> command. Instead, you create a route policy to select routes from the routing table and export them into BGP.</p><p>First, create a policy statement that defines what to advertise. Here, we'll advertise direct interface routes.</p><pre><code>[/]
A:admin@SR-1# configure policy-options policy-statement "export-direct"
*[pr:/... policy-statement "export-direct"]
A:admin@SR-1# entry 10
*[pr:/... "export-direct" entry 10]
A:admin@SR-1# from
*[pr:/... entry 10 from]
A:admin@SR-1# protocol direct
*[pr:/... entry 10 from]
A:admin@SR-1# exit
*[pr:/... "export-direct" entry 10]
A:admin@SR-1# action
*[pr:/... entry 10 action]
A:admin@SR-1# accept
*[pr:/... entry 10 action]
A:admin@SR-1# exit all</code></pre><p>Next, apply this policy to your BGP group or neighbor.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" bgp group "eBGP-Peers"
*[pr:/configure router "Base" bgp group "eBGP-Peers"]
A:admin@SR-1# export-policy "export-direct"
*[pr:/configure router "Base" bgp group "eBGP-Peers"]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>5. BGP Verification (Operational Mode)</h3><ul><li><code>[/]
A:admin@SR-1# show router "Base" bgp summary</code></li></ul><div class="note"><p>This is a very basic BGP configuration. Real-world BGP involves complex route policies (import/export), route reflectors, confederations, path attributes manipulation, and various address families (IPv6, VPN-IPv4, etc.).</p></div>` },
            { id: 'sr-isis-basics', title: 'SR-MPLS (SR-ISIS)', content: `<h2>Segment Routing MPLS (SR-ISIS)</h2><p>Segment Routing (SR) simplifies network operations and enables source-based routing by encoding paths as a sequence of segments (SIDs). When used with IS-IS (SR-ISIS), IS-IS advertises SIDs, allowing MPLS to use these segments for traffic engineering and path control without requiring LDP or RSVP-TE for basic label distribution.</p><h3>1. Enabling Segment Routing in IS-IS</h3><p>First, ensure IS-IS is already configured (as per the "ISIS Basics" section). Then, enable segment routing capabilities within the IS-IS instance.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" isis 0 segment-routing
*[pr:/... isis 0 segment-routing]
A:admin@SR-1# admin-state enable
*[pr:/... isis 0 segment-routing]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>2. Configuring Segment Routing Global Block (SRGB)</h3><p>The SRGB defines a range of MPLS labels reserved for segment routing. This range must be consistent across all routers in the SR domain.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" segment-routing
*[pr:/configure router "Base" segment-routing]
A:admin@SR-1# segment-routing-global-block "default" lower-bound 16000 upper-bound 23999
*[pr:/configure router "Base" segment-routing]
A:admin@SR-1# admin-state enable
*[pr:/configure router "Base" segment-routing]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>3. Configuring Node SIDs</h3><p>Node SIDs identify a specific router. They are typically assigned to loopback interfaces and advertised by IS-IS. The Node SID is an index into the SRGB, which results in an MPLS label.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" isis 0 interface "loopback0" segment-routing
*[pr:/... interface "loopback0" segment-routing]
A:admin@SR-1# node-sid index 101
*[pr:/... interface "loopback0" segment-routing]
A:admin@SR-1# admin-state enable
*[pr:/... interface "loopback0" segment-routing]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>4. SR-ISIS Verification (Operational Mode)</h3><ul><li><code>[/]
A:admin@SR-1# show router "Base" isis 0 segment-routing prefix-sids</code></li></ul>` },
            { id: 'srv6-basics', title: 'SRv6', content: `<h2>Segment Routing v6 (128-bits)</h2><p>Segment Routing over IPv6 (SRv6) extends the Segment Routing paradigm to the IPv6 data plane. Instead of MPLS labels, SRv6 uses IPv6 addresses as Segment Identifiers (SIDs). IS-IS can be used as the IGP to advertise SRv6 SIDs and capabilities.</p><h3>1. Prerequisites</h3><pre><code>[/]
A:admin@SR-1# configure router "Base" interface "loopback0" ipv6
*[pr:/... interface "loopback0" ipv6]
A:admin@SR-1# address 2001:db8:0:1::1/128
*[pr:/... interface "loopback0" ipv6]
A:admin@SR-1# exit
*[pr:/... "loopback0"]
A:admin@SR-1# exit
*[pr:/]
A:admin@SR-1# configure router "Base" isis 0
*[pr:/configure router "Base" isis 0]
A:admin@SR-1# family ipv6 unicast
*[pr:/configure router "Base" isis 0]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>2. Enabling SRv6 in IS-IS</h3><pre><code>[/]
A:admin@SR-1# configure router "Base" isis 0 segment-routing-v6
*[pr:/... isis 0 segment-routing-v6]
A:admin@SR-1# admin-state enable
*[pr:/... isis 0 segment-routing-v6]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>3. Configuring SRv6 Locators</h3><pre><code>[/]
A:admin@SR-1# configure router "Base" segment-routing-v6 locator "main_locator"
*[pr:/... segment-routing-v6 locator "main_locator"]
A:admin@SR-1# prefix 2001:db8:cafe::/48
*[pr:/... segment-routing-v6 locator "main_locator"]
A:admin@SR-1# admin-state enable
*[pr:/... segment-routing-v6 locator "main_locator"]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><p>Associate this locator with the IS-IS instance for advertisement:</p><pre><code>[/]
A:admin@SR-1# configure router "Base" isis 0 segment-routing-v6 locator "main_locator"
*[pr:/... segment-routing-v6 locator "main_locator"]
A:admin@SR-1# admin-state enable
*[pr:/... segment-routing-v6 locator "main_locator"]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>4. SRv6 Verification (Operational Mode)</h3><ul><li><code>[/]
A:admin@SR-1# show router "Base" isis 0 segment-routing-v6 locators</code></li></ul>` },
            { id: 'evpn-basics', title: 'L2 EVPN', content: `<h2>L2 EVPN</h2><p>Ethernet VPN (EVPN) is a BGP-based technology that provides advanced Layer 2 and Layer 3 VPN services. This section focuses on basic L2 EVPN using a VPLS service with BGP-EVPN signaling.</p><h3>2. Prerequisites</h3><p>BGP neighbors must be configured to support the <code>evpn</code> address family.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" bgp group "iBGP-EVPN-Peers" neighbor 192.168.255.2 family evpn
*[pr:/... neighbor 192.168.255.2 family evpn]
A:admin@SR-1# admin-state enable
*[pr:/... neighbor 192.168.255.2 family evpn]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>3. Configuring a VPLS Service with BGP-EVPN</h3><pre><code>[/]
A:admin@SR-1# configure service vpls 100
*[pr:/configure service vpls 100]
A:admin@SR-1# admin-state enable
*[pr:/configure service vpls 100]
A:admin@SR-1# bgp
*[pr:/configure service vpls 100 bgp]
A:admin@SR-1# route-distinguisher auto-rd
*[pr:/configure service vpls 100 bgp]
A:admin@SR-1# route-target export target:65001:100
*[pr:/configure service vpls 100 bgp]
A:admin@SR-1# route-target import target:65001:100
*[pr:/configure service vpls 100 bgp]
A:admin@SR-1# exit
*[pr:/configure service vpls 100]
A:admin@SR-1# bgp-evpn mpls
*[pr:/... bgp-evpn mpls]
A:admin@SR-1# admin-state enable
*[pr:/... bgp-evpn mpls]
A:admin@SR-1# auto-bind-tunnel resolution any
*[pr:/... bgp-evpn mpls]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>4. EVPN Verification (Operational Mode)</h3><ul><li><code>[/]
A:admin@SR-1# show service id 100 bgp-evpn detail</code></li></ul>` },
            { id: 'vprn-basics', title: 'L3 VPN (VPRN)', content: `<h2>L3 VPN (VPRN)</h2><p>A Virtual Private Routed Network (VPRN) is a Layer 3 VPN service that uses a dedicated virtual router instance for each customer. It provides traffic separation and isolated routing tables, with routes being exchanged between Provider Edge (PE) routers using MP-BGP.</p><h3>2. Prerequisites</h3><p>BGP neighbors must be configured to support the <code>vpn-ipv4</code> address family.</p><pre><code>[/]
A:admin@SR-1# configure router "Base" bgp group "iBGP-VPN-Peers" neighbor 192.168.255.2 family vpn-ipv4
*[pr:/... neighbor 192.168.255.2 family vpn-ipv4]
A:admin@SR-1# admin-state enable
*[pr:/... neighbor 192.168.255.2 family vpn-ipv4]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>3. Configuring a VPRN Service</h3><pre><code>[/]
A:admin@SR-1# configure service vprn 200
*[pr:/configure service vprn 200]
A:admin@SR-1# admin-state enable
*[pr:/configure service vprn 200]
A:admin@SR-1# autonomous-system 65100
*[pr:/configure service vprn 200]
A:admin@SR-1# route-distinguisher auto-rd
*[pr:/configure service vprn 200]
A:admin@SR-1# route-target export target:65001:200
*[pr:/configure service vprn 200]
A:admin@SR-1# route-target import target:65001:200
*[pr:/configure service vprn 200]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h4>b. Create a VPRN Interface (CE-facing)</h4><pre><code>[/]
A:admin@SR-1# configure service vprn 200 interface "to-CE1"
*[pr:/... vprn 200 interface "to-CE1"]
A:admin@SR-1# admin-state enable
*[pr:/... vprn 200 interface "to-CE1"]
A:admin@SR-1# address 10.10.10.1/30
*[pr:/... vprn 200 interface "to-CE1"]
A:admin@SR-1# sap 1/1/2:200
*[pr:/... vprn 200 interface "to-CE1"]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h4>c. Configure PE-CE BGP Peering</h4><pre><code>[/]
A:admin@SR-1# configure service vprn 200 bgp group "CE-Peers" neighbor 10.10.10.2
*[pr:/... group "CE-Peers" neighbor 10.10.10.2]
A:admin@SR-1# admin-state enable
*[pr:/... group "CE-Peers" neighbor 10.10.10.2]
A:admin@SR-1# peer-as 65200
*[pr:/... group "CE-Peers" neighbor 10.10.10.2]
A:admin@SR-1# commit
Commit Succeeded.</code></pre><h3>4. VPRN Verification (Operational Mode)</h3><ul><li><code>[/]
A:admin@SR-1# show service id 200 route-table</code></li></ul>` },
            { id: 'show-commands', title: 'Important Show Commands', content: `<h2>Important 'Show' Commands</h2><p>The <code>show</code> command, executed in operational mode (e.g., <code>[/]#</code> prompt), is your primary tool for monitoring and troubleshooting in SR OS MD-CLI.</p><h3>System & Hardware</h3><ul><li><code>show system information</code></li><li><code>show card detail</code></li></ul><h3>Routing (Specify Router Instance, e.g., "Base")</h3><ul><li><code>show router "Base" route-table</code></li><li><code>show router "Base" bgp summary</code></li></ul><h3>Services (Examples - Specify Service ID/Name)</h3><ul><li><code>show service id 100 bgp-evpn detail</code></li><li><code>show service id 200 route-table</code></li></ul>` },
            { id: 'references', title: 'References & Further Reading', content: `<h2>References & Further Reading</h2><p>This section contains useful links for further learning and official documentation.</p><h3>Official Nokia Documentation</h3><ul><li><a href="https://www.nokia.com/ip-networks/service-router-operating-system-nos/" target="_blank" rel="noopener noreferrer">Nokia Service Router Operating System</a></li><li><a href="https://documentation.nokia.com/sr/25-3/index.html" target="_blank" rel="noopener noreferrer">SR OS Documentation Portal (25.3)</a></li><li><a href="https://documentation.nokia.com/sr/25-3/7750-sr/titles/md-cli-user.html" target="_blank" rel="noopener noreferrer">SR OS MD-CLI User Guide (25.3)</a></li><li><a href="https://documentation.nokia.com/sr/25-3/7750-sr/titles/basic-system-configuration.html" target="_blank" rel="noopener noreferrer">SR OS Basic System Configuration Guide (25.3)</a></li><li><a href="https://documentation.nokia.com/sr/25-3/7750-sr/titles/unicast-routing-protocols.html" target="_blank" rel="noopener noreferrer">SR OS Unicast Routing Protocols Guide (25.3)</a></li><li><a href="https://documentation.nokia.com/sr/25-3/7750-sr/titles/segment-routing-pce-user.html" target="_blank" rel="noopener noreferrer">SR OS Segment Routing and PCE User Guide (25.3)</a></li><li><a href="https://documentation.nokia.com/sr/25-3/7750-sr/titles/layer-2-services-evpn.html" target="_blank" rel="noopener noreferrer">SR OS Layer 2 Services and EVPN Guide (25.3)</a></li><li><a href="https://documentation.nokia.com/sr/25-3/7750-sr/titles/layer-3-services-vprn.html" target="_blank" rel="noopener noreferrer">SR OS Layer 3 Services and VPRN Guide (25.3)</a></li></ul><h3>YANG Models & Automation</h3><ul><li><a href="https://github.com/nokia/7x50_YangModels" target="_blank" rel="noopener noreferrer">Nokia 7X50 YANG Models on GitHub</a></li></ul><h3>Community & Learning Resources</h3><ul><li><em class="text-gray-500">Link to relevant networking blogs to be added here.</em></li><li><em class="text-gray-500">Link to other useful SR OS learning websites to be added here.</em></li></ul>` }
        ];

        // --- Application Logic ---
        const sidebar = document.getElementById('sidebar');
        const contentArea = document.getElementById('content-area');
        const initialMessage = document.getElementById('initial-message');

        // Function to render sidebar links
        function renderSidebar() {
            sidebar.innerHTML = ''; // Clear existing links before rendering
            topics.forEach(topic => {
                const link = document.createElement('a');
                link.href = `#${topic.id}`;
                link.textContent = topic.title;
                link.classList.add('block', 'py-2', 'px-3', 'rounded-md', 'text-slate-600', 'dark:text-slate-400', 'hover:bg-slate-200', 'dark:hover:bg-slate-700/50', 'sidebar-link');
                link.dataset.topicId = topic.id;
                sidebar.appendChild(link);
            });
        }

        // Function to render content for a topic
        function renderContent(topicId) {
            const topic = topics.find(t => t.id === topicId);
            if (topic) {
                if(initialMessage) initialMessage.style.display = 'none';
                contentArea.innerHTML = topic.content;

                // Add copy to clipboard buttons to all pre blocks
                contentArea.querySelectorAll('pre').forEach(preBlock => {
                    const codeText = preBlock.querySelector('code')?.innerText;
                    if (!codeText) return;

                    const button = document.createElement('button');
                    button.innerHTML = '<svg xmlns="http://www.w3.org/2000/svg" class="h-4 w-4" fill="none" viewBox="0 0 24 24" stroke="currentColor"><path stroke-linecap="round" stroke-linejoin="round" stroke-width="2" d="M8 16H6a2 2 0 01-2-2V6a2 2 0 012-2h8a2 2 0 012 2v2m-6 12h8a2 2 0 002-2v-8a2 2 0 00-2-2h-8a2 2 0 00-2 2v8a2 2 0 002 2z" /></svg>';
                    button.className = 'copy-button';
                    
                    button.addEventListener('click', () => {
                        const textArea = document.createElement('textarea');
                        textArea.value = codeText;
                        document.body.appendChild(textArea);
                        textArea.select();
                        try {
                            document.execCommand('copy');
                            button.innerHTML = 'Copied!';
                        } catch (err) {
                            console.error('Failed to copy text: ', err);
                            button.textContent = 'Error';
                        }
                        document.body.removeChild(textArea);

                        setTimeout(() => {
                           button.innerHTML = '<svg xmlns="http://www.w3.org/2000/svg" class="h-4 w-4" fill="none" viewBox="0 0 24 24" stroke="currentColor"><path stroke-linecap="round" stroke-linejoin="round" stroke-width="2" d="M8 16H6a2 2 0 01-2-2V6a2 2 0 012-2h8a2 2 0 012 2v2m-6 12h8a2 2 0 002-2v-8a2 2 0 00-2-2h-8a2 2 0 00-2 2v8a2 2 0 002 2z" /></svg>';
                        }, 2000);
                    });
                    preBlock.appendChild(button);
                });
                contentArea.scrollTop = 0;
            } else {
                 if(initialMessage) {
                    initialMessage.style.display = 'block';
                    contentArea.innerHTML = '';
                    contentArea.appendChild(initialMessage);
                 }
            }
        }

        function setActiveLink(topicId) {
            document.querySelectorAll('.sidebar-link').forEach(link => {
                link.classList.toggle('active', link.dataset.topicId === topicId);
            });
        }

        function initializeApp() {
            renderSidebar();
            
            sidebar.addEventListener('click', (event) => {
                const link = event.target.closest('a.sidebar-link');
                if (link && link.dataset.topicId) {
                    event.preventDefault();
                    const topicId = link.dataset.topicId;
                    window.location.hash = topicId;
                }
            });

            const currentHash = window.location.hash.substring(1) || 'introduction';
            renderContent(currentHash);
            setActiveLink(currentHash);

            // --- Theme Toggle Logic ---
            const themeToggleBtn = document.getElementById('theme-toggle');
            const themeToggleDarkIcon = document.getElementById('theme-toggle-dark-icon');
            const themeToggleLightIcon = document.getElementById('theme-toggle-light-icon');

            function applyTheme(theme) {
                if (theme === 'dark') {
                    themeToggleLightIcon.classList.add('hidden');
                    themeToggleDarkIcon.classList.remove('hidden');
                } else {
                    themeToggleDarkIcon.classList.add('hidden');
                    themeToggleLightIcon.classList.remove('hidden');
                }
            }

            const currentTheme = document.documentElement.classList.contains('dark') ? 'dark' : 'light';
            applyTheme(currentTheme);

            themeToggleBtn.addEventListener('click', () => {
                const isDark = document.documentElement.classList.toggle('dark');
                const newTheme = isDark ? 'dark' : 'light';
                localStorage.setItem('theme', newTheme);
                applyTheme(newTheme);
            });
        }
        
        window.addEventListener('hashchange', () => {
            const currentHash = window.location.hash.substring(1) || 'introduction';
            renderContent(currentHash);
            setActiveLink(currentHash);
        });

        document.addEventListener('DOMContentLoaded', initializeApp);
    </script>
</body>
</html>
